Port security:
SW1(config)#int g0/2 //go through the interface to fix it's port security
SW1(config-if)#switchport port-security //enable the feature of port security
SW1(config-if)#switchport mode access //set the port != dynamic
SW1(config-if)#switchport access vlan 10 //choose the vlan for this port
SW1(config-if)#switchport port-security maximum 5 //choose the number of addresses on port is eq to 5
SW1(config-if)#switchport port-security aging type inactivity //turn inactivity on
SW1(config-if)#switchport port-security aging time 5 //after 5 min turn inactive
SW1(config-if)#switchport port-security violation restrict/shutdown/protect //to set the violation policy
SW1(config-if)#switchport port-security mac-address sticky
SW1(config-if)#switchport port-security mac-address 0000.1111.2222 //to set a mac address statically
SW1(config-if)#do show run int g0/2 //to check the configuration
SW1(config-if)#do show port-security address //to check the addresses configured with port security

dhcp snooping:
SW1(config)#ip dhcp snooping //enable feature
SW1(config)#ip dhcp snooping vlan 10  //enable feature on specific vlan
SW1(config)#int g0/3
SW1(config-if)#ip dhcp snooping trust //enable trust for dhcp server
SW1(config-if)#exit
SW1(config)#int range g0/5-6
SW1(config-if-range)#ip dhcp snooping limit rate 10
SW1(config-if-range)#switchport port-security
SW1(config-if-range)#switchport port-maximum 5
SW1(config-if-range)#exit
SW1(config)#do show ip dhcp snooping //to check the snooping conf
SW1(config)#do show ip dhcp binding //to check the configured dhcp server trusted

Private VLANL:
SW1(config)#default int range g0/11-15
SW1(config)#vtp mode transparent //required for private vlans
SW1(config)#vlan 500//create vlan
SW1(config-vlan)#private-vlan community //set as private vlan community
SW1(config-vlan)#exit
SW1(config)#vlan 400 //create vlan
SW1(config-vlan)#private-vlan community //set as private vlan community
SW1(config-vlan)#exit
SW1(config)# vlan 200
SW1(config-vlan)# private-vlan isolated //set as private vlan isolated
SW1(config-vlan)#exit
SW1(config)#vlan 100
SW1(config-vlan)#private-vlan primary //set as private primary vlan
SW1(config-vlan)#private-vlan association 200,300,400,500 //set the vlan 200, 300,400 and 500 as a secondary vlan for the primary vlan 100
SW1(config-vlan)#exit
SW1(config)# int g0/11
SW1(config-if)#switchport mode private-vlan promiscuous //for the primary vlan
SW1(config-if)#switchport private-vlan mapping 100,200,300,400,500
SW1(config-if)#exit
SW1(config)# int range g0/12-13
SW1(config-if-range)#switchport mode private-vlan host //place interfaces in isolated vlan
SW1(config-if-range)#switchport private-vlan host-association 100 200 //list the primary vlan then secondary isolated vlan
SW1(config-if-range)#exit
SW1(config)#int g0/14
SW1(config-if)#switchport mode private-vlan host
SW1(config-if)#switchport private-vlan host-association 100 300 //community assign to the primary vlan
SW1(config-if)#exit
SW1(config)#int g0/15
SW1(config-if)#switchport mode private-vlan host
SW1(config-if)#switchport private-vlan host-association 100 400
SW1(config-if)#exit
SW1(config)#int range g0/11-15
SW1(config-if-range)#no shutdown
SW1(config-if-range)#end
SW1#show vlan private-vlan //to check the vlans
SW1#show int g0/11 switchport

Dynamic arp inspection:
SW1# show ip dhcp snooping table //arp inspection uses the dhcp snooping table
SW1#conf t
SW1(config)#ip arp inspection vlan 123 //enable DAI on vlan 123
SW1(config)#do show ip arp inspection vlan 123 //to check the config for dai on vlan 123
SW1(config)#int g0/1
SW1(config-if)#ip arp inspection trust //set the interface g0/1 on the switch as trusted
SW1(config-if)#exit
SW1(config)#int g0/2
SW1(config-if)#ip arp inspection limit rate 10 //untrusted port
SW1(config-if)#exit
SW1(config)# do show ip dhcp snooping binding //to check the dhcp snooping tables configured
SW1(config)# arp access-list our-acl //to create arp acl 
SW1(config-arp-nacl)#permit ip host 10.123.0.1 mac ... //adding policies to ACL
SW1(config-arp-nacl)#exit
SW1(config)#do show arp access-list our-acl //to check the acl created configuration
SW1(config)#ip arp inspection filter our-acl vlan 123 //to apply the acl created on vlan 123

Firewall:
R1(config)# ip access-list extended OUT //to create an extended access list named OUT
R1(config-ext-nacl)# permit tcp any any reflect REMEMBER //policies
R1(config-ext-nacl)# permit udp any any reflect REMEMBER
R1(config-ext-nacl)# permit icmp any any reflect REMEMBER
R1(config-ext-nacl)#deny ip any any log
R1(config-ext-nacl)#exit
R1(config)#int f0/4
R1(config-if)#ip access-group OUT out
R1(config)# do show access-list //to show access lists
R1(config)#ip access-list extended IN
R1(config-ext-nacl)#evaluate REMEMBER
R1(config-ext-nacl)#deny ip any any log
R1(config-ext-nacl)#exit
R1(config)#int f0/4
R1(config-if)# ip access-group IN in
R1(config-if)#exit
R1(config)# do show access-list 

Create a cbac(context based access control) on firewall
R1(config)# ip inspect name REMEMBER TCP
R1(config)# ip inspect name REMEMBER UDP
R1(config)# ip inspect name REMEMBER ICMP
R1(config)# int f0/4
R1(config-if)# ip inspect REMEMBER OUT
R1(config-if)#exit
R1(config)# do show ip inspect interfaces //to check the rules added and created

Zone based DMZ:
R1# conf t
R1(config)# no service timestamps log //remove the timestamps from the log messages
R1(config)# no service timestamps debug //remove the timestamps for debug messages
R1(config)# access-list 1 permit 10.0.0.0 0.255.255.255 
R1(config)# ip nat inside source list 1 interface fa 0/0 //nat
R1(config)# ip nat inside source list 1 interface fa 0/0 overload //pat
R1(config)# int f0/1
R1(config-if)# ip nat inside //translate to private pool on this interface
R1(config-if)# exit
R1(config)# int f0/0
R1(config-if)#ip nat outside //translate to public ip on this interface
R1(config-if)#exit
R1(config)#zone security out-zone //create a security zone named out-zone
R1(config-sec-zone)#exit
R1(config)#zone security in-zone //create a security zone named in-zone
R1(config-sec-zone)#exit
R1(config)# int f0/0
R1(config-if)# zone-member security out-zone //  f0/0 defined as out zo9ne
R1(config-if)# exit
R1(config)# int f0/1
R1(config-if)# zone-member security in-zone //  f0/1 defined as in zone
R1(config-if)# exit
R1(config)# class-map type inspect match-any INSPECTED
R1(config-cmap)#match protocol icmp
R1(config-cmap)#match protocol tcp
R1(config-cmap)#match protocol udp
R1(config-cmap)#exit
R1(config)#policy-map type inspect POLICY
R1(config-pmap)# class type inspect INSPECTED
R1(config-pmap-c)# inspect
R1(config-pmap-c)#exit
R1(config-pmap)#zone-pair security in-2-out source in-zone destination out-zone
R1(config-sec-zone-pair)#service-policy type inspect POLICY
R1(config-sec-zone-pair)#exit
R1(config)#end
R1#show policy-map type inspect zone-pair //show zone pair configuration

DMZ ASA firewall:
ciscoasa> enable
ciscoasa#conf t
ciscoasa(config)# int e0/5
ciscoasa(config-if)#switchport access vlan 1
ciscoasa(config-if)#no shutdown
ciscoasa(config-if)#exit
ciscoasa(config)#interface vlan 1
ciscoasa(config-if)#security-level 100
ciscoasa(config-if)#nameif INSIDE
ciscoasa(config-if)#ip address 10.0.0.1 255.255.255.0
ciscoasa(config-if)#exit
ciscoasa(config)#http server enable //asa gui
ciscoasa(config)#http 10.0.0.0 255.255.255.0 INSIDE
ciscoasa(config)#show int ip br
ciscoasa(config)# int gig 0 //outside interface
ciscoasa(config-if)#security-level 0 //oustide interface
ciscoasa(config-if)#nameif outside
ciscoasa(config-if)#ip address 192.168.1.250 255.255.255.0
ciscoasa(config-if)# no shutdown
ciscoasa(config-if)# exit
ciscoasa(config)# int gig 1 //inside interface
ciscoasa(config-if)# security-level 100
ciscoasa(config-if)# nameif inside
ciscoasa(config-if)# ip address 10.1.0.250 255.255.255.0
ciscoasa(config-if)# no shutdown 
ciscoasa(config-if)# exit
ciscoasa(config)# route outside 0.0.0.0 0.0.0.0 192.168.1.1
ciscoasa(config)# route inside 10.0.0.0 255.0.0.0 10.1.0.1
ciscoasa(config)# ping 8.8.8.8
ciscoasa(config)# traceroute 8.8.8.8
ciscoasa(config)#wr

Router1 Configuration:
R1(config)# int f0/1 
R1(config-if)# ip address 10.0.0.1 255.255.255.0
R1(config-if)# no shutdown
R1(config-if)# exit
R1(config)#int f0/0
R1(config-if)# ip address 10.1.0.1 255.255.255.0
R1(config-if)# ip route 0.0.0.0 0.0.0.0 10.1.0.250
R1(config)# end
R1# wr
R1#conf t
R1(config)# ip domain-name cisco.com
R1(config)# crypto key generate rsa modulus 2048
R1(config)# username admin privilege 15 secret LouaySerhal123@#$
R1(config)# line vty 0 4 
R1(config-line)# login local
R1(config-line)#exit
R1(config)# access-list 1 permit host 192.168.1.92
R1(config)# snmp-server group OUR-GROUP v3 priv read write
R1(config)# snmp-server group OUR-GROUP v3 auth sha louay123 priv aes 256 louay123 access 1
R1(config)# privilege exec level 7 ping
R1(config)# username Louay secret louay123
R1(config)# username Louay privilege 7
R1(config)# end
R1#wr


PC1> ip 10.0.0.25 255.255.255.0 gateway 10.0.0.1


Server1(config)# int f0/0 
Server1(config-if)# no shutdown
Server1(config-if)# ip address 10.2.0.3 255.255.255.0
Server1(config-if)# exit
Server1(config-if)# ip http server
Server1(config-if)#ip http authentication local
Server1(config-if)# user admin privilege 15 secret Louay
Server1(config-if)# exit
Server1(config)# ip route 0.0.0.0 0.0.0.0 10.2.0.250
Server1(config)# end
Server1# wr

Configure Cisco Routers for Syslog, NTP, and SSH Operations using OSPF:
R1>en
R1#conf t
R1(config)#int s0/0/0
R1(config-if)#ip ospf message-digest-key 1 md5 MD5pa55
R1(config-if)#exit
R1(config)#ntp server 192.168.1.5
R1(config)#ntp update-calendar 
R1(config)#ntp authenticate
R1(config)#ntp trusted-key 1
R1(config)#ntp authentication-key 1 md5 NTPpa55
R1(config)#service timestamps log datetime msec
R1(config)#logging host 192.168.1.6

R2>en
R2#conf t
R2(config)#router ospf 1 //enable ospf with process id 1
R2(config-router)#area 0 authentication message-digest  //Message digest authentication ensures that OSPF routers authenticate each other's OSPF packets using a shared secret key.
R2(config-router)#exit
//enable hashing on interfaces of message keys
R2(config)#int s0/0/0
R2(config-if)#ip ospf message-digest-key 1 md5 MD5pa55
R2(config-if)#exit
R2(config)#int s0/0/1
R2(config-if)#ip ospf message-digest-key 1 md5 MD5pa55
R2(config-if)#exit
R2(config)#ntp server 192.168.1.5 //enable network time protocol
R2(config)#ntp update-calendar 
R2(config)#ntp authenticate 
R2(config)#ntp trusted-key 1
R2(config)#ntp authentication-key 1 md5 NTPpa55
R2(config)#service timestamps log datetime msec //to show the time with logs
R2(config)#logging host 192.168.1.6

R3>en
R3#conf t
R3(config)#router ospf 1
R3(config-router)#area 0 authentication message-digest 
R3(config-router)#exit
R3(config)#int s0/0/1
R3(config-if)#ip ospf message-digest-key 1 md5 MD5pa55
R3(config-if)#exit
R3(config)#ntp server 192.168.1.5
R3(config)#ntp update-calendar 
R3(config)#ntp authenticate
R3(config)#ntp trusted-key 1
R3(config)#ntp authentication-key 1 md5 NTPpa55
R3(config)#service timestamps log datetime msec 
R3(config)#logging host 192.168.1.6
R3(config)#ip domain-name ccnasecurity.com
R3(config)#line vty 0 4
R3(config-line)#login local
R3(config-line)#transport input ssh //deny telnet 
R3(config-line)#exit
R3(config)#crypto key generate rsa
R3(config)#ip ssh time-out 90
R3(config)#ip ssh authentication-retries 2 //two wrong password will terminate the session
R3(config)#ip ssh version 2

AAA local/tacacs+/radius Servers:
R1#conf t
R1(config)#username Admin1 secret admin1pa55
R1(config)#aaa new-model
R1(config)#aaa authentication login default local
R1(config)#line console 0
R1(config-line)#login authentication default 
R1(config-line)#exit
R1(config)#no ip domain lookup
R1(config)#ip domain-name ccnasecurity.com
R1(config)#crypto key generate rsa general-keys modulus 1024
R1(config)#aaa authentication login SSH-LOGIN local
R1(config)#line vty 0 4
R1(config-line)#login authentication SSH-LOGIN
R1(config-line)#transport input ssh
R1(config-line)#exit
R1(config)#exit

R2#conf t
R2(config)#username Admin2 secret admin2pa55
R2(config)#tacacs-server host 192.168.2.2
R2(config)#tacacs-server key tacacspa55
R2(config)#aaa new-model 
R2(config)#aaa authentication login default group tacacs+ local
R2(config)#line console 0
R2(config-line)#login authentication default 
R2(config-line)#no ip domain lookup
R2(config)#end



R3(config)#username Admin3 secret adminpa55
R3(config)#radius-server host 192.168.3.2
R3(config)#radius-server key radiuspa55
R3(config)#aaa new-model 
R3(config)#aaa authentication login default group radius local
R3(config)#line console 0
R3(config-line)#login authentication default
R3(config-line)#end

DMZ:
R3(config)#license boot module c1900 technology-package securityk9 
R3(config)#do reload
R3(config)#zone security IN-ZONE
R3(config-sec-zone)#exit
R3(config)#zone security OUT-ZONE
R3(config-sec-zone)#exit
R3(config)#access-list 101 permit ip 192.168.3.0 0.0.0.255 any
R3(config)#class-map type inspect match-all IN-NET-CLASS-MAP
R3(config-cmap)#match access-group 101
R3(config-cmap)#exit
R3(config)#policy-map type inspect IN-2-OUT-PMAP
R3(config-pmap)#class type inspect IN-NET-CLASS-MAP
R3(config-pmap-c)#inspect
R3(config-pmap-c)#exit
R3(config-pmap)#exit
R3(config)#zone-pair security IN-2-OUT-ZPAIR source IN-ZONE destination OUT-ZONE
R3(config-sec-zone-pair)#service-policy type inspect IN-2-OUT-PMAP
R3(config-sec-zone-pair)#exit
R3(config)#int g0/1
R3(config-if)#zone-member security IN-ZONE
R3(config-if)#exit
R3(config)#int s0/0/1
R3(config-if)#zone-member security OUT-ZONE
R3(config-if)#exit
R3(config)#do show policy-map type inspect zone-pair sessions

Extended ACL:
R1(config)#access-list 10 permit host 192.168.3.3
R1(config)#line vty 0 15
R1(config-line)#access-class 10 in
R1(config-line)#exit
R1(config)#access-list 120 permit udp any host 192.168.1.3 eq domain
R1(config)#access-list 120 permit tcp any host 192.168.1.3 eq smtp
R1(config)#access-list 120 permit tcp any host 192.168.1.3 eq ftp
R1(config)#access-list 120 deny tcp any host 192.168.1.3 eq 443
R1(config)#access-list 120 permit tcp host 192.168.3.3 host 10.1.1.1 eq 22
R1(config)#int s0/0/0
R1(config-if)#ip access-group 120 in
R1(config-if)#exit
R1(config)#access-list 120 permit icmp any any echo-reply
R1(config)#access-list 120 permit icmp any any unreachable
R1(config)#access-list 120 deny icmp any any
R1(config)#access-list 120 permit ip any any

R2(config)#access-list 10 permit host 192.168.3.3
R2(config)#line vty 0 15
R2(config-line)#access-class 10 in


R3(config)#access-list 10 permit host 192.168.3.3
R3(config)#line vty 0 15
R3(config-line)#access-class 10 in
R3(config-line)#exit
R3(config)#access-list 110 permit ip 192.168.3.0 0.0.0.255 any
R3(config)#int g0/1
R3(config-if)#ip access-group 110 in
R3(config-if)#exit
R3(config)#access-list 100 permit tcp 10.0.0.0 0.255.255.255 eq 22 host 192.168.3.3
R3(config)#access-list 100 permit ip any any
R3(config)#access-list 100 deny ip 10.0.0.0 0.255.255.255 any
R3(config)#access-list 100 deny ip 172.16.0.0 0.15.255.255 any
R3(config)#access-list 100 deny ip 192.168.0.0 0.0.255.255 any
R3(config)#access-list 100 deny ip 127.0.0.0 0.255.255.255 any
R3(config)#access-list 100 deny ip 224.0.0.0 15.255.255.255 any
R3(config)#int s0/0/1
R3(config-if)#ip access-group 100 in

Extended ACL:
RTA(config)#access-list 199 permit tcp 10.101.117.32 0.0.0.15 10.101.117.0 0.0.0.31 eq 22
RTA(config)#access-list 199 permit icmp any any
RTA(config)#int g0/2
RTA(config-if)#ip access-group 199 out

Intrusion prevention systems:
R1(config)#license boot module c1900 technology-package securityk9
R1(config)#do reload
R1#mkdir ipsdir
R1#conf t
R1(config)#ip ips config location flash:ipsdir
R1(config)#ip ips name iosips
R1(config)#ip ips notify log 
R1(config)#service timestamps log datetime msec 
R1(config)#logging host 192.168.1.50
R1(config)#ip ips signature-category
R1(config-ips-category)#category all
R1(config-ips-category-action)#retired true
R1(config-ips-category-action)#exit
R1(config-ips-category)#category ios_ips basic
R1(config-ips-category-action)#retired false
R1(config-ips-category-action)#exit
R1(config-ips-category)#exit
R1(config)#int g0/1
R1(config-if)#ip ips iosips out
R1(config-if)#exit
R1(config)#ip ips signature-definition
R1(config-sigdef)#signature 2004 0
R1(config-sigdef-sig)#status
R1(config-sigdef-sig-status)#retired false
R1(config-sigdef-sig-status)#enabled true
R1(config-sigdef-sig-status)#exit
R1(config-sigdef-sig)#engine
R1(config-sigdef-sig-engine)#event-action produce-alert
R1(config-sigdef-sig-engine)#event-action deny-packet-inline 
R1(config-sigdef-sig-engine)#exit
R1(config-sigdef-sig)#exit
R1(config-sigdef)#exit
R1(config)#do wr

Layer 2(Data link & network) Security:
Central(config)#spanning-tree vlan 1 root primary
SW-1(config)#spanning-tree vlan 1 root secondary 
SW-1(config)#int range f0/23-24
SW-1(config-if-range)#spanning-tree guard root
SW-2(config)#int range f0/23-24
SW-2(config-if-range)#spanning-tree guard root
SW-A(config)#int range f0/1-4
SW-A(config-if-range)#spanning-tree portfast 
SW-A(config-if-range)#spanning-tree bpduguard enable 
SW-A(config-if-range)#exit
SW-A(config)#int range f0/1-22
SW-A(config-if-range)#sw mode access 
SW-A(config-if-range)#sw port-security 
SW-A(config-if-range)#sw port-security maximum 2
SW-A(config-if-range)#sw port-security violation shutdown 
SW-A(config-if-range)#sw port-security mac-address sticky
SW-A(config-if-range)#exit
SW-A(config)#int range f0/5-22
SW-A(config-if-range)#shutdown 
SW-B(config)#int range f0/1-4
SW-B(config-if-range)#spanning-tree portfast 
SW-B(config-if-range)#spanning-tree bpduguard enable 
SW-B(config-if-range)#exit
SW-B(config)#int range f0/1-22
SW-B(config-if-range)#sw mode access 
SW-B(config-if-range)#sw port-security 
SW-B(config-if-range)#sw port-security maximum 2
SW-B(config-if-range)#sw port-security violation shutdown 
SW-B(config-if-range)#sw port-security mac-address sticky 
SW-B(config-if-range)#exit
SW-B(config)#int range f0/5-22
SW-B(config-if-range)#shutdown 

Vlan Security:
SW-1(config)#int f0/23
SW-1(config-if)#sw mode trunk
SW-1(config-if)#sw trunk native vlan 15
SW-1(config-if)#sw nonegotiate 
SW-1(config-if)#no shutdown 
SW-1(config-if)#exit
SW-1(config)#vlan 20
SW-1(config-vlan)#exit
SW-1(config)#int vlan 20
SW-1(config-if)#ip address 192.168.20.3 255.255.255.0

SW-2(config)#int f0/23
SW-2(config-if)#sw mode trunk
SW-2(config-if)#sw trunk native vlan 15
SW-2(config-if)#sw nonegotiate
SW-2(config-if)#no shutdown
SW-2(config-if)#exit
SW-2(config)#vlan 20
SW-2(config-vlan)#exit
SW-2(config)#int vlan 20
SW-2(config-if)#ip address 192.168.20.4 255.255.255.0

SW-A(config)#vlan 20
SW-A(config-vlan)#exit
SW-A(config)#int vlan 20
SW-A(config-if)#ip address 192.168.20.1 255.255.255.0
SW-A(config-if)#exit
SW-A(config)#int f0/1
SW-A(config-if)#sw access vlan 20
SW-A(config-if)#no shutdown

SW-B(config)#vlan 20
SW-B(config-vlan)#exit
SW-B(config)#int vlan 20
SW-B(config-if)#ip address 192.168.20.2 255.255.255.0

Central(config)#vlan 20
Central(config-vlan)#exit
Central(config)#int vlan 20
Central(config-if)#ip addr 192.168.20.5 255.255.255.0

R1(config)#int g0/0.3
R1(config-subif)#encapsulation dot1Q 20
R1(config-subif)#ip address 192.168.20.100 255.255.255.0
R1(config-subif)#exit
R1(config)#access-list 101 deny ip any 192.168.20.0 0.0.0.255 
R1(config)#access-list 101 permit ip any any
R1(config)#access-list 102 permit ip host 192.168.20.50 any
R1(config)#int g0/0.1
R1(config-subif)#ip access-group 101 in
R1(config-subif)#exit
R1(config)#int g0/0.2
R1(config-subif)#ip access-group 101 in
R1(config-subif)#exit
R1(config)#line vty 0 15
R1(config-line)#access-class 102 in

VPN:

R1(config)# license boot module c1900 technology-package securityk9
R1(config)# do reload
R1(config)#access-list 110 permit ip 192.168.1.0 0.0.0.255 192.168.3.0 0.0.0.255
R1(config)#crypto isakmp policy 10
R1(config-isakmp)#encryption aes 256
R1(config-isakmp)#authentication pre-share 
R1(config-isakmp)#group 5
R1(config-isakmp)#exit
R1(config)#crypto isakmp key vpnpa55 address 10.2.2.2
R1(config)#crypto ipsec transform-set VPN-SET esp-aes esp-sha-hmac
R1(config)#crypto map VPN-MAP 10 ipsec-isakmp 
R1(config-crypto-map)#description VPN connection to R3
R1(config-crypto-map)#set peer 10.2.2.2
R1(config-crypto-map)#set transform-set VPN-SET
R1(config-crypto-map)#match address 110
R1(config-crypto-map)#exit
R1(config)#interface s0/0/0
R1(config-if)#crypto map VPN-MAP

R3(config)# license boot module c1900 technology-package securityk9
R3(config)# do reload
R3(config)#access-list 110 permit ip 192.168.3.0 0.0.0.255 192.168.1.0 0.0.0.255
R3(config)#crypto isakmp policy 10
R3(config-isakmp)#encryption aes 256
R3(config-isakmp)#authentication pre-share 
R3(config-isakmp)#group 5
R3(config-isakmp)#exit
R3(config)# crypto isakmp key vpnpa55 address 10.1.1.2
R3(config)#crypto ipsec transform-set VPN-SET esp-aes esp-sha-hmac
R3(config)#crypto map VPN-MAP 10 ipsec-isakmp 
R3(config-crypto-map)#description VPN connection to R1
R3(config-crypto-map)#set peer 10.1.1.2
R3(config-crypto-map)#set transform-set VPN-SET
R3(config-crypto-map)#match address 110
R3(config-crypto-map)#exit
R3(config)#int s0/0/1
R3(config-if)#crypto map VPN-MAP

ASA:
ciscoasa(config)#enable password ciscoenpa55
ciscoasa(config)#hostname CCNAS-ASA
CCNAS-ASA(config)#domain-name ccnasecurity.com
CCNAS-ASA(config)#interface vlan 1
CCNAS-ASA(config-if)#nameif inside
CCNAS-ASA(config-if)#ip address 192.168.1.1 255.255.255.0
CCNAS-ASA(config-if)#security-level 100
CCNAS-ASA(config-if)#exit
CCNAS-ASA(config)#int vlan 2
CCNAS-ASA(config-if)#nameif outside
CCNAS-ASA(config-if)#ip address 209.165.200.226 255.255.255.248
CCNAS-ASA(config-if)#security-level 0
CCNAS-ASA(config-if)#exit
CCNAS-ASA(config)#object network inside-net
CCNAS-ASA(config-network-object)#subnet 192.168.1.0 255.255.255.0
CCNAS-ASA(config-network-object)#nat (inside, outside) dynamic interface
CCNAS-ASA(config-network-object)#exit
CCNAS-ASA(config-cmap)#match default-inspection-traffic
CCNAS-ASA(config-cmap)#exit
CCNAS-ASA(config)#policy-map global_policy
CCNAS-ASA(config-pmap)#class inspection_default
CCNAS-ASA(config-pmap-c)#inspect icmp
CCNAS-ASA(config-pmap-c)#exit
CCNAS-ASA(config)#service-policy global_policy global 
CCNAS-ASA(config)#dhcpd address 192.168.1.5-192.168.1.36 inside
CCNAS-ASA(config)#dhcpd dns 209.165.201.2 interface inside
CCNAS-ASA(config)#dhcpd enable inside
CCNAS-ASA(config)#username admin password adminpa55
CCNAS-ASA(config)#aaa authentication ssh console LOCAL
CCNAS-ASA(config)#ssh 192.168.1.0 255.255.255.0 inside
CCNAS-ASA(config)#ssh 172.16.3.3 255.255.255.255 outside
CCNAS-ASA(config)#ssh timeout 10
CCNAS-ASA(config)#interface vlan 3
CCNAS-ASA(config-if)#ip address 192.168.2.1 255.255.255.0
CCNAS-ASA(config-if)#no forward interface vlan 1
CCNAS-ASA(config-if)#nameif dmz
CCNAS-ASA(config-if)#security-level 70
CCNAS-ASA(config-if)#exit
CCNAS-ASA(config)#interface eth0/2
CCNAS-ASA(config-if)#sw access vlan 3
CCNAS-ASA(config-if)#exit
CCNAS-ASA(config)#object network dmz-server
CCNAS-ASA(config-network-object)#host 192.168.2.3
CCNAS-ASA(config-network-object)#nat (dmz,outside) static 209.165.200.227
CCNAS-ASA(config-network-object)#exit
CCNAS-ASA(config)#access-list OUTSIDE-DMZ permit icmp any host 192.168.2.3
CCNAS-ASA(config)#access-list OUTSIDE-DMZ permit tcp any host 192.168.2.3 eq 80
CCNAS-ASA(config)#access-group OUTSIDE-DMZ in interface outside

WCCP Server configuration:
Router(config)# ip wccp version 2
Router(config)# ip wccp web-cache password <password>
Router(config)# interface fa0/0
Router(config-if)# ip wccp web-cache redirect out 
Router(config-if)#end


